import { IMAGES } from "../../../assets";
import Container from "../../Reusable/Container/Container";

const AboutMe = () => {
    return (
        <div className="p-5 mt-20 bg-neutral-light-10 font-Nunito-Bengali">
            <Container>
                <div className="flex flex-col lg:flex-row items-center gap-10">
                    <div className="flex flex-col gap-7 text-neutral-10/80 font-medium">
                        <h1 className="text-neutral-10 text-5xl font-bold max-w-[600px] leading-[70px] mt-3">
                            আমার সম্পর্কে
                        </h1>
                        <p className="">
                            সহকারি অধ্যাপক রূপক চন্দ্র রায়, শিক্ষক, গবেষক, চিকিৎসা নিয়ে ১৪বছরের বেশি অভিজ্ঞতা।  আমি গণ বিশ্ববিদ্যালয়ের ফ্যাকাল্টি অফ হেলথ সাইন্সেস থেকে  স্নাতক  ডিগ্রী অর্জন করেছি এবং এক বছরের বাধ্যতামূলক ইন্টার্নশীপ গণস্বাস্থ্য সমাজ ভিত্তিক মেডিকেল কলেজের ফিজিওথেরাপি বিভাগে সম্পন্ন করেছি। তার সাথে আমি গণ বিশ্ববিদ্যালয়ের ফ্যাকাল্টি অব পোস্ট গ্রাজুয়েট হেলথ সাইন্স থেকে স্নাতকোত্তর  ডিগ্রী অর্জন করেছি, আশা ইউনিভার্সিটি অফ বাংলাদেশ থেকে মাস্টার্স অফ পাবলিক হেলথ (হসপিটাল ম্যানেজমেন্ট) এর উপরে স্নাতকোত্তর ডিগ্রী অর্জন করেছি, দুর্যোগ ব্যবস্থাপনায় ঢাকা বিশ্ববিদ্যালয় থেকে পোস্ট গ্রাজুয়েট ডিজাস্টার ম্যানেজমেন্ট সম্পন্ন করেছি এবং ঢাক  বিশ্ববিদ্যালয় থেকে দুর্যোগ ব্যবস্থাপনায় স্নাতকোত্তর ডিগ্রী  সফলতার সাথে সম্পন্ন করেছি, বারডেম একাডেমি থেকে সার্টিফিকেট ইন মেডিকেল এডুকেশন কোর্সটি সম্পর্ণ করি।বর্তমানে আমি জগন্নাথ বিশ্ববিদ্যালয়ের ফ্যাকাল্টি অফ লাইফ অ্যান্ড আর্থ সাইন্স এর ডিপার্টমেন্ট অব সাইকোলজিতে এম.ফিল (স্কলার) -আমার গবেষণার বিষয় হল "ইমপেক্ট অফ ফিজিওথেরাপি অন সাইকোলজিক্যাল ওয়েল বিইং অফ পেশেন্ট সাফারিং ফ্রম লো ব্যাক পেইন"। প্রায় ১০ টি দেশীয় এবং আন্তর্জাতিক জার্নালে গবেষণা প্রকাশনা হয়েছে।নয়টি  গবেষণার সংক্ষিপ্তসার দেশীয় এবং আন্তর্জাতিক  সম্মেলনে  প্রকাশিত হয়েছে। কন্টিনিউয়াস প্রফেশনাল ডেভেলপমেন্ট (সিপিডি) এবং স্বাস্থ্য সম্পর্কিত ওয়েবিনারে  অংশগ্রহণ করেছি। সায়েন্টিফিক রিসার্চ জার্নাল অফ মেডিকেল এন্ড হেলথ সাইন্সে রিভিউয়ার এডিটরের দায়িত্ব পালন করছি। রিভিউ বোর্ড মেম্বার  মেডিকন মেডিকেল সাইন্স জার্নাল এবং ইউরোপিয়ান জার্নাল অফ মেডিকেল এন্ড হেল্থ সাইন্সেস এ এসোসিয়েট এডিটর এর দায়িত্ব পালন করছি।
                        </p>
                        

                        <a href="http://wa.me/8801722237642" target="_blank" rel="noopener noreferrer" className="w-fit">
                            <button className="bg-primary-10 px-10 py-3 rounded-3xl text-white font-bold text-sm cursor-pointer w-fit">
                                যোগাযোগ করুন
                            </button>
                        </a>
                    </div>
                    <img
                        src={IMAGES.aboutUsImg}
                        alt="doctor"
                        className="w-[500px] relative z-10"
                    />
                </div>
            </Container>
        </div>
    );
};

export default AboutMe;